In [ ]:
import course;course.header()

# Pandas level 1
Data wrangling 101

I'd like to say Pandas is numpy on steriods but it is actually much more.

Pandas is the data science solution for Python and it build ontop of the powerful numpy module.
However, Pandas offers elements that are much more intuitive or go beyond what numpy has ever provided.
Nevertheless, numpy is more performant in some cases (by a lot, yet remember when to optimize!) 

The perfect is the dead of the good.
 -- M. Gunner

Pandas was create [Wes McKinney](https://wesmckinney.com/pages/about.html) in the early 2008 at AQR capital management and I can recommend "Python for Data Analysis" from Wes, which was published via O'Reilly and "Pandas for Everyone" by Daniel Y. Chen. The following Pandas chapters are inspired by the books.

Pandas offers the two basic data structures
* Series
* Dataframes

In [1]:
import pandas as pd
import numpy as np

In [2]:
c = pd.Series(
    np.random.randn(4), 
    index=['r1', 'r2', 'r3', 'r4']
)
c

r1   -0.514256
r2    0.262654
r3    0.680207
r4   -1.009600
dtype: float64

Selecting from Series works like a dict :)

In [3]:
c['r2']

0.2626544439268679

In [4]:
mask = c > 0
mask

r1    False
r2     True
r3     True
r4    False
dtype: bool

In [5]:
c[mask]

r2    0.262654
r3    0.680207
dtype: float64

Masks can be additive!

In [6]:
mask2 = c < 1
c[mask & mask2]

r2    0.262654
r3    0.680207
dtype: float64

In [7]:
c * 10

r1    -5.142562
r2     2.626544
r3     6.802065
r4   -10.096000
dtype: float64

In [8]:
np.exp(c)

r1    0.597945
r2    1.300377
r3    1.974285
r4    0.364365
dtype: float64

Remember to use numpy functions as much as possible so data remains on the "C side". More below!

Operations conserve index!

Series are like ordered Dicts!

In [9]:
'r1' in c

True

np.nan is the missing value indicator

In [10]:
d = pd.Series({'r1': np.nan, 'r2': 0.2, 'r3': 0.2, 'r4': 0.4})

In [11]:
d

r1    NaN
r2    0.2
r3    0.2
r4    0.4
dtype: float64

In [12]:
d.isna()

r1     True
r2    False
r3    False
r4    False
dtype: bool

In [13]:
# inverting with ~!
~d.isna()

r1    False
r2     True
r3     True
r4     True
dtype: bool

In [14]:
d.notnull()

r1    False
r2     True
r3     True
r4     True
dtype: bool

## indices are aligned automatically!

In [15]:
c

r1   -0.514256
r2    0.262654
r3    0.680207
r4   -1.009600
dtype: float64

In [16]:
d = pd.Series(
    np.random.randn(4), 
    index=['r2', 'r3', 'r4', 'r5']
)
d

r2    0.009714
r3    0.145131
r4   -0.540788
r5   -0.371142
dtype: float64

In [17]:
c + d

r1         NaN
r2    0.272369
r3    0.825337
r4   -1.550388
r5         NaN
dtype: float64

## Renaming index

In [18]:
d.index = ['r1', 'r2', 'r3', 'r4']

In [19]:
c + d

r1   -0.504542
r2    0.407785
r3    0.139419
r4   -1.380742
dtype: float64

Naming things will help you to get your data organised better. Explicit is better than implicit! And remember to choose your names variable wisely - you will code read often than you write.

In [20]:
d.index.name = "variable"
d.name = "probability"
d

variable
r1    0.009714
r2    0.145131
r3   -0.540788
r4   -0.371142
Name: probability, dtype: float64

In [21]:
d.reset_index()

  variable  probability
0       r1     0.009714
1       r2     0.145131
2       r3    -0.540788
3       r4    -0.371142

Turns it into a DataFrame as the index is now a series!

In [22]:
type(d.reset_index())

pandas.core.frame.DataFrame

# Data frames 
Data frames are the pandas 2d data containers (if there is only one index dimension). 
In principle data frames are a list of Series, whereas each row is a series.

In [23]:
df = pd.DataFrame(
    [
        c, 
        d, # this one we named :)
        pd.Series(np.random.randn(4), index=['r2', 'r3', 'r4', 'r5'])
    ]
)
df

                   r1        r2        r3        r4        r5
Unnamed 0   -0.514256  0.262654  0.680207 -1.009600       NaN
probability  0.009714  0.145131 -0.540788 -0.371142       NaN
Unnamed 1         NaN -1.829309  2.694192  0.759455 -0.212082

In [24]:
# accessing a value
df.loc['probability', 'r2']

0.14513092350237325

Note: How pandas aligns your data automatically.

If you want each series to be treated as column, just transpose

DataFrames can be constructed in many different ways, see docu for more details
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html?highlight=dataframe#pandas.DataFrame

In [25]:
df = df.T
df

    Unnamed 0  probability  Unnamed 1
r1  -0.514256     0.009714        NaN
r2   0.262654     0.145131  -1.829309
r3   0.680207    -0.540788   2.694192
r4  -1.009600    -0.371142   0.759455
r5        NaN          NaN  -0.212082

Renaming columns in a data frame

In [26]:
df.columns = ['p1', 'p2', 'p3']
df

          p1        p2        p3
r1 -0.514256  0.009714       NaN
r2  0.262654  0.145131 -1.829309
r3  0.680207 -0.540788  2.694192
r4 -1.009600 -0.371142  0.759455
r5       NaN       NaN -0.212082

Dataframes can equally be named, for your sanity, name them :)

In [27]:
df.columns.name = "probability"
df.index.name = "variable"
df

probability        p1        p2        p3
variable
r1          -0.514256  0.009714       NaN
r2           0.262654  0.145131 -1.829309
r3           0.680207 -0.540788  2.694192
r4          -1.009600 -0.371142  0.759455
r5                NaN       NaN -0.212082

Now that you feel happy in the pandas world, some modules/functions require numpy arrays, how do you convert them ?

In [28]:
np_df = df.values
np_df

array([[-0.51425621,  0.00971415,         nan],
       [ 0.26265444,  0.14513092, -1.82930918],
       [ 0.68020655, -0.54078754,  2.69419235],
       [-1.00960003, -0.37114165,  0.7594545 ],
       [        nan,         nan, -0.21208218]])

In [29]:
type(np_df)

numpy.ndarray

If you need to work "longer" on the numpy side, I suggest to transform the pandas dataframe to a numpy recarray, as names are preserved;

In [30]:
# np_df = df.values # 
np_df = df.to_records()
np_df

rec.array([('r1', -0.51425621,  0.00971415,         nan),
           ('r2',  0.26265444,  0.14513092, -1.82930918),
           ('r3',  0.68020655, -0.54078754,  2.69419235),
           ('r4', -1.00960003, -0.37114165,  0.7594545 ),
           ('r5',         nan,         nan, -0.21208218)],
          dtype=[('variable', 'O'), ('p1', '<f8'), ('p2', '<f8'), ('p3', '<f8')])

In [31]:
np_df['variable']

array(['r1', 'r2', 'r3', 'r4', 'r5'], dtype=object)

In [32]:
np_df[0]

('r1', -0.51425621, 0.00971415, nan)

In [33]:
np_df[0][2]

0.00971414719559546

## C-side and Python side

**Note**:
Regular Python floats live in the Python world - Numpy and Pandas live in the "C world", hence their fast vectorized operations. If you can avoid it, don't cast between the worlds!

In [34]:
long_series = pd.Series(
    np.random.randn(1000000), 
)

In [35]:
%%timeit -n 1
a = long_series.to_list()  # to python list!
print(f"a is a {type(a)} now!")
pd.Series(a)

a is a <class 'list'> now!
a is a <class 'list'> now!
a is a <class 'list'> now!
a is a <class 'list'> now!
a is a <class 'list'> now!
a is a <class 'list'> now!
a is a <class 'list'> now!
134 ms ± 9.21 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [36]:
%%timeit -n 1
a = long_series.to_numpy()
print(f"a is a {type(a)} now!")
pd.Series(a)

a is a <class 'numpy.ndarray'> now!
a is a <class 'numpy.ndarray'> now!
a is a <class 'numpy.ndarray'> now!
a is a <class 'numpy.ndarray'> now!
a is a <class 'numpy.ndarray'> now!
a is a <class 'numpy.ndarray'> now!
a is a <class 'numpy.ndarray'> now!
The slowest run took 4.32 times longer than the fastest. This could mean that an intermediate result is being cached.
140 µs ± 102 µs per loop (mean ± std. dev. of 7 runs, 1 loop each)

# Operations between DataFrame and Series

In [37]:
df_small = pd.DataFrame([c, d])
df_small

                   r1        r2        r3        r4
Unnamed 0   -0.514256  0.262654  0.680207 -1.009600
probability  0.009714  0.145131 -0.540788 -0.371142

In [38]:
c

r1   -0.514256
r2    0.262654
r3    0.680207
r4   -1.009600
dtype: float64

In [39]:
df_small - c

                  r1        r2        r3        r4
Unnamed 0    0.00000  0.000000  0.000000  0.000000
probability  0.52397 -0.117524 -1.220994  0.638458

Next time you want to normalize each row of a data frame, one can define the correction factors as a series and just e.g. subtract it.

In [40]:
# renaming columns

In [41]:
df

probability        p1        p2        p3
variable
r1          -0.514256  0.009714       NaN
r2           0.262654  0.145131 -1.829309
r3           0.680207 -0.540788  2.694192
r4          -1.009600 -0.371142  0.759455
r5                NaN       NaN -0.212082

In [42]:
df.rename(columns={'p1':'VLC'}, inplace=True)

In [43]:
df

probability       VLC        p2        p3
variable
r1          -0.514256  0.009714       NaN
r2           0.262654  0.145131 -1.829309
r3           0.680207 -0.540788  2.694192
r4          -1.009600 -0.371142  0.759455
r5                NaN       NaN -0.212082

In [44]:
# subselecting a set of columns! 
df[["VLC", 'p2']]

probability       VLC        p2
variable
r1          -0.514256  0.009714
r2           0.262654  0.145131
r3           0.680207 -0.540788
r4          -1.009600 -0.371142
r5                NaN       NaN

**Note:**
This only creates a view of the data!

# Pandas IO
Pandas comes with a wide array of input output modules see
https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

**NOTE:** reading xlsx is _much_ slower than csv

Your request: Scraping websites! 

Today with Pandas scraping wikipedia. In particular the oldest universities!

Alternatively beautiful soup https://www.crummy.com/software/BeautifulSoup/bs4/doc/ or Scrapy https://scrapy.org/

In [45]:
url = "https://en.wikipedia.org/wiki/List_of_oldest_universities_in_continuous_operation"

In [46]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

In [47]:
dfs = pd.read_html(url) # do you get SSL: CERTIFICATE_VERIFY_FAILED ?

In [48]:
len(dfs)

9

In [49]:
dfs[1]

                                      Year  \
                                      Year
0               1088(charter granted 1158)
1   1096–1167(charter granted in 1248)[11]
2           1134 (charter granted in 1218)
3        1209(charter granted in 1231)[16]
4                     1222(probably older)
5                              1224 (1258)
6                                1240–1357
7                                     1290
8                                     1290
9                                     1293
10                                    1293
11                                    1303
12                                    1308
13                                    1321
14                                    1343
15                                    1348
16                                    1361
17                                    1364
18                                    1365
19                                    1386
20                                    1391
21                                    1404
22                                    1409
23                                    1413
24                                    1434
25                                1450[29]
26                                    1451
27                                    1456
28                                    1457
29                                    1460
30                                    1472
31                                    1477
32                                    1477
33                                    1479
34                                    1481
35                                    1495
36                                    1495
37                                    1499

                                University  \
                                University
0                    University of Bologna
1                     University of Oxford
2                  University of Salamanca
3                  University of Cambridge
4                      University of Padua
5         University of Naples Federico II
6                      University of Siena
7                University of Coimbra[23]
8               University of Macerata[23]
9                 University of Valladolid
10        Complutense University of Madrid
11             Sapienza University of Rome
12                   University of Perugia
13                  University of Florence
14                      University of Pisa
15                      Charles University
16                     University of Pavia
17                 Jagiellonian University
18                    University of Vienna
19  Ruprecht Karl University of Heidelberg
20                   University of Ferrara
21                     University of Turin
22                   University of Leipzig
23               University of St. Andrews
24                   University of Catania
25                 University of Barcelona
26                   University of Glasgow
27                University of Greifswald
28   Albert Ludwigs University of Freiburg
29                     University of Basel
30  Ludwig Maximilian University of Munich
31   Eberhard Karls University of Tübingen
32                      Uppsala University
33                University of Copenhagen
34                     University of Genoa
35                  University of Aberdeen
36    University of Santiago de Compostela
37                  University of Valencia

                                      Location                                 \
                                      Original                        Current
0          Kingdom of Italy, Holy Roman Empire                 Bologna, Italy
1                           Kingdom of England         Oxford, United Kingdom
2                              Kingdom of León               Salamanca, Spain
3                           Kingdom of England      Cambridge, United Kingdom
4                    Medieval commune of Padua                   Padua, Italy
5                            Kingdom of Sicily                  Naples, Italy
6                            Republic of Siena                   Siena, Italy
7                          Kingdom of Portugal              Coimbra, Portugal
8                                 Papal States                Macerata, Italy
9                             Crown of Castile              Valladolid, Spain
10                            Crown of Castile                  Madrid, Spain
11                                Papal States                    Rome, Italy
12                                Papal States                 Perugia, Italy
13                        Republic of Florence                Florence, Italy
14                            Republic of Pisa                    Pisa, Italy
15       Kingdom of Bohemia, Holy Roman Empire         Prague, Czech Republic
16             Domain of the House of Visconti                   Pavia, Italy
17                           Kingdom of Poland                 Kraków, Poland
18                           Holy Roman Empire                Vienna, Austria
19                           Holy Roman Empire            Heidelberg, Germany
20                               House of Este                 Ferrara, Italy
21                              Duchy of Savoy                   Turin, Italy
22                           Holy Roman Empire               Leipzig, Germany
23                         Kingdom of Scotland    St. Andrews, United Kingdom
24                           Kingdom of Sicily                 Catania, Italy
25                             Crown of Aragon               Barcelona, Spain
26                         Kingdom of Scotland        Glasgow, United Kingdom
27                           Holy Roman Empire            Greifswald, Germany
28                           Holy Roman Empire              Freiburg, Germany
29                           Holy Roman Empire             Basel, Switzerland
30                           Holy Roman Empire                Munich, Germany
31                           Holy Roman Empire              Tübingen, Germany
32   Kingdom of Sweden within the Kalmar Union                Uppsala, Sweden
33  Kingdom of Denmark within the Kalmar Union            Copenhagen, Denmark
34                           Republic of Genoa                   Genoa, Italy
35                         Kingdom of Scotland       Aberdeen, United Kingdom
36        Kingdom of Galicia, Crown of Castile  Santiago de Compostela, Spain
37                             Crown of Aragon                Valencia, Spain

                                                Notes
                                                Notes
0   The oldest university in the world. A universi...
1   Oxford claims its founding ("...teaching exist...
2   The oldest university in the Hispanic world. T...
3   Founded by scholars leaving Oxford after a dis...
4   Founded by scholars and professors after leavi...
5   The first public university,[20] founded by Fr...
6   Originally founded in 1240 by the Commune of S...
7   It began its existence in Lisbon with the name...
8   Founded in 1290, possibly as a private law sch...
9   Founded in the late 13th century (first docume...
10  The University of Alcalá was founded by Sancho...
11  Founded by Pope Boniface VIII, but became a st...
12            Attested by the Bull of Pope Clement V.
13  The University of Florence evolved from the St...
14  It was formally founded on 3 September 1343 by...
15  Three of four faculties closed in 1419. Merged...
16  Closed for short periods during the Italian Wa...
17  Founded by Casimir the Great under the name St...
18               Modelled on the University of Paris.
19  Founded by Rupert I, Elector Palatine. The old...
20                 Founded by Marquis Alberto d'Este.
21  Founded by the prince "Louis of Piedmont" duri...
22  Founded when German-speaking staff left Prague...
23  A school of higher studies was founded in 1410...
24  The oldest in Sicily. Founded by Alfonso V of ...
25  Founded by Alfonso V of Aragon as Estudi gener...
26                           Founded by a Papal bull.
27  Teaching had started by 1436. Founded by initi...
28  Temporarily transferred to Constance in 1686–9...
29  Founded in 1460 (Schola Basiliensis), the Univ...
30  Founded in Ingolstadt in 1472; with a Papal Bu...
31                                                NaN
32  Uppsala's bull, which granted the university i...
33  The University of Copenhagen is the oldest uni...
34              Founded in 1481 (Genuense Athenaeum).
35  King's College was founded by a Papal bull in ...
36  The university traces its roots to 1495, when ...
37                                                NaN

In [50]:
udf = dfs[1]

In [51]:
udf.columns

MultiIndex([(      'Year',       'Year'),
            ('University', 'University'),
            (  'Location',   'Original'),
            (  'Location',    'Current'),
            (     'Notes',      'Notes')],
           )

In [52]:
udf.columns = [ e[0] for e in udf.columns ]

In [53]:
udf.head(2)

,Year,University,Location,Location,Notes
0,1088(charter granted 1158),University of Bologna,"Kingdom of Italy, Holy Roman Empire","Bologna, Italy",The oldest university in the world. A universi...
1,1096–1167(charter granted in 1248)[11],University of Oxford,Kingdom of England,"Oxford, United Kingdom","Oxford claims its founding (""...teaching exist..."

In [54]:
udf.columns = ['Year', 'University', 'H-Location', 'G-Location', 'Notes' ]

In [55]:
udf.head()

,Year,University,H-Location,G-Location,Notes
0,1088(charter granted 1158),University of Bologna,"Kingdom of Italy, Holy Roman Empire","Bologna, Italy",The oldest university in the world. A universi...
1,1096–1167(charter granted in 1248)[11],University of Oxford,Kingdom of England,"Oxford, United Kingdom","Oxford claims its founding (""...teaching exist..."
2,1134 (charter granted in 1218),University of Salamanca,Kingdom of León,"Salamanca, Spain",The oldest university in the Hispanic world. T...
3,1209(charter granted in 1231)[16],University of Cambridge,Kingdom of England,"Cambridge, United Kingdom",Founded by scholars leaving Oxford after a dis...
4,1222(probably older),University of Padua,Medieval commune of Padua,"Padua, Italy",Founded by scholars and professors after leavi...

## Gather some basic information around the dataframe

In [56]:
udf.describe()

,Year,University,H-Location,G-Location,Notes
count,38,38,38,38,36
unique,34,38,23,38,36
top,1293,University of Perugia,Holy Roman Empire,"Uppsala, Sweden",A school of higher studies was founded in 1410...
freq,2,1,8,1,1

In [57]:
udf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        38 non-null     object
 1   University  38 non-null     object
 2   H-Location  38 non-null     object
 3   G-Location  38 non-null     object
 4   Notes       36 non-null     object
dtypes: object(5)
memory usage: 1.6+ KB

We need to clean-up the Year

Accessing the str properties!

In [ ]:
udf['Year'].str.match(r'^(?P<year>[0-9]{4})')

In [ ]:
udf['year'] = udf.Year.str.extract(r'(?P<year>[0-9]{4})')

In [ ]:
udf.head()

In [ ]:
udf.shape
# (rows, columns)

One cannot visualize all columns straight away in jupyter :( However redefining some options helps!

In [ ]:
pd.set_option("max_columns", 2000)

# Sorting

In [ ]:
udf.head()

In [ ]:
udf.sort_values(['year'])

Sort_values has kwargs like ascending = True|False and values are defined by a list, ie sort first by, then by ...

In [ ]:
udf.sort_values(['year', 'G-Location'])

Let split the G-location into city and country!

In [ ]:
tmp_df = udf['G-Location'].str.split(",")
display(tmp_df.head())   # not quite what we want .. we want two columns!

How to get two columns?

In [ ]:
tmp_df = udf['G-Location'].str.split(",", expand=True)
tmp_df.columns = ['G-City', 'G-Country']

In [ ]:
tmp_df

In [ ]:
udf = udf.join(tmp_df)
# there are many options to join frames

In [ ]:
udf.head()

# Deleting things

In [ ]:
udf.head()

In [ ]:
udf.drop(1)

In [ ]:
udf.head(3)

In [ ]:
udf.drop(columns=['G-Location', 'Year'])

Dataframe or series are not automatically "adjusted" except you use `inpace=True`

In [ ]:
udf

In [ ]:
udf.drop(columns=['G-Location', 'Year'], inplace=True)

In [ ]:
udf

# slicing and dicing

In [ ]:
udf[:3] # df[:'r3'] works as well

In [ ]:
# selecting one column!
udf['G-Country']

In [ ]:
# selecting one row
udf.loc[1]

In [ ]:
udf.info()

In [ ]:
# mask also work on df!
mask = udf['year'] < 1400
mask.head(10)

In [ ]:
udf.year = udf.year.astype(int)

In [ ]:
_udf = udf.convert_dtypes()

In [ ]:
_udf.info()

In [ ]:
# mask also work on df!
mask = udf.year < 1400
mask.head(10)

In [ ]:
udf[mask]

In [ ]:
udf[udf['year'] < 1300] # reduces the data frame, again note! that is just a view, not a copy!

In [ ]:
udf[udf['year'] < 1300].loc[1]

In [ ]:
udf[udf['year'] > 1300].loc[1]

In [ ]:
udf[udf['year'] > 1300].head(3)

In [ ]:
udf[udf['year'] > 1300].iloc[1]

## more natural query - or isn't it?

In [ ]:
udf.query("year > 1300").head(5)

In [ ]:
udf.query("1349 > year > 1320")

In [ ]:
# Using local variables in queries
upper_limit = 1400
udf.query("@upper_limit > year > 1320")

## Find the maximum for a given series or dataframe

In [ ]:
udf['year'].idxmax()

## Unique values and their count

In [ ]:
udf['G-Country'].unique()

In [ ]:
udf['G-Country'].nunique()

In [ ]:
udf['G-Country'].value_counts()

In [ ]:
_udf = udf.set_index('University')

In [ ]:
_udf.sample(5)

In [ ]:
_udf.loc['University of Florence', ['Notes', 'year']]

In [ ]:
_udf.loc['University of Florence', :]

## Done with Basics!
Take a look at the cheat sheet for a summary
https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

# Hierarchical indexing

In [ ]:
s = pd.Series(
        np.random.randn(5), 
        index = [
            ['p1','p1','p2','p2','p3'],
            ['a','b','a','d','a']
        ]
)
s

In [ ]:
s.index

In [ ]:
s.index.names = ['probability', 'type']

In [ ]:
s

In [ ]:
s['p1']

In [ ]:
s[:, 'a'] # lower level

In [ ]:
s2 = s.unstack()
print(type(s2))
s2

In [ ]:
s3 = s2.stack()
print(type(s3))
s3

## Multindex with Dataframes

In [ ]:
df = pd.DataFrame(
    [
        c, 
        c * 20, 
        d,
        np.exp(d),
        pd.Series(np.random.randn(4), index=['r2', 'r3', 'r4', 'r5'])
    ],
    index = [
        ['p1','p1','p2','p2','p3'],
        ['a','b','a','d','a']
    ]
)
df.index.names = ['probability', 'type']
df

In [ ]:
df = df.fillna(0)
df

**Note**:
You can create multi indeces from a regular dataframe!

In [ ]:
df2 = df.reset_index()

In [ ]:
df2

In [ ]:
df2.set_index(['probability', 'type'])

In [ ]:
df2 = df.swaplevel('probability', 'type')
df2

In [ ]:
df2.sort_index(axis=0, level=0)

## Natural slicing using `pandas.IndexSlice`  objects

In [ ]:
idx = pd.IndexSlice
df2.loc[idx[:, ["p1", "p2"]], :]

## long and wide formats

In [ ]:
df3 = df2.reset_index()
df3

In [ ]:
df4 = df3.melt(
    id_vars=['type','probability'],
    var_name='r_stage',
    value_name='score'
)
print(df4.shape)
df4.head()

In [ ]:
df5 = df4.pivot_table(index=['type', 'probability'], columns='r_stage', values="score")
df5